<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"418bf5a53697d734783e46bbd86c282d587ab8ed4276f0df04a740c9b796b23c","plan_job_ref":"Job Terraform Plan #11 at https://github.com/thetheilred/test-eks/actions/runs/13099274265","plan_out_hash":"ef94e05476a575dbfd9cc1a1635e63b3d50e4d64739dab793aee377ff22aeb09","plan_hash":"0600e49b303be972e3583ae5eea52cab56e3f4884224f5a1a7c4ac9bff714ca0","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __terraform/eks__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_eks_cluster.example will be created
+   resource "aws_eks_cluster" "example" {
+       arn                           = (known after apply)
+       bootstrap_self_managed_addons = true
+       certificate_authority         = (known after apply)
+       cluster_id                    = (known after apply)
+       created_at                    = (known after apply)
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       identity                      = (known after apply)
+       name                          = "example"
+       platform_version              = (known after apply)
+       role_arn                      = "arn:aws:iam::730335642042:role/eks-cluster-example"
+       status                        = (known after apply)
+       tags_all                      = (known after apply)
+       version                       = "1.31"

+       access_config {
+           authentication_mode = "API"
        }

+       kubernetes_network_config (known after apply)

+       upgrade_policy (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = (known after apply)
+           subnet_ids                = [
+               "subnet-05e6d85d1c0e679e1",
+               "subnet-067506e073b3485f2",
+               "subnet-0df63a1fd283987d4",
            ]
+           vpc_id                    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #4](https://github.com/thetheilred/test-eks/actions/runs/13099288163)